<a href="https://colab.research.google.com/github/SachiSachu/1stop/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [3]:
cs = pd.read_csv("http://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data")
type(cs)

pandas.core.frame.DataFrame

In [4]:
cs

     5.1  3.5  1.4  0.2     Iris-setosa
0    4.9  3.0  1.4  0.2     Iris-setosa
1    4.7  3.2  1.3  0.2     Iris-setosa
2    4.6  3.1  1.5  0.2     Iris-setosa
3    5.0  3.6  1.4  0.2     Iris-setosa
4    5.4  3.9  1.7  0.4     Iris-setosa
..   ...  ...  ...  ...             ...
144  6.7  3.0  5.2  2.3  Iris-virginica
145  6.3  2.5  5.0  1.9  Iris-virginica
146  6.5  3.0  5.2  2.0  Iris-virginica
147  6.2  3.4  5.4  2.3  Iris-virginica
148  5.9  3.0  5.1  1.8  Iris-virginica

[149 rows x 5 columns]

In [7]:
cs.head() # first five lines

   5.1  3.5  1.4  0.2  Iris-setosa
0  4.9  3.0  1.4  0.2  Iris-setosa
1  4.7  3.2  1.3  0.2  Iris-setosa
2  4.6  3.1  1.5  0.2  Iris-setosa
3  5.0  3.6  1.4  0.2  Iris-setosa
4  5.4  3.9  1.7  0.4  Iris-setosa

In [8]:
cs.tail() # last five lines

     5.1  3.5  1.4  0.2     Iris-setosa
144  6.7  3.0  5.2  2.3  Iris-virginica
145  6.3  2.5  5.0  1.9  Iris-virginica
146  6.5  3.0  5.2  2.0  Iris-virginica
147  6.2  3.4  5.4  2.3  Iris-virginica
148  5.9  3.0  5.1  1.8  Iris-virginica

In [14]:
cs.columns

Index(['5.1', '3.5', '1.4', '0.2', 'Iris-setosa'], dtype='object')

In [16]:
new1 = pd.read_csv("http://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data", header=None) #remove headers

In [19]:
new1.head()

     0    1    2    3            4
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [20]:
new1.columns

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [22]:
#we have 5 columns , assigning new column names to them
new1.columns = ['c1','c2','c3','c4','c5']
new1.head()

    c1   c2   c3   c4           c5
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [23]:
new1.shape

(150, 5)

In [26]:
new1.describe()

               c1          c2          c3          c4
count  150.000000  150.000000  150.000000  150.000000
mean     5.843333    3.054000    3.758667    1.198667
std      0.828066    0.433594    1.764420    0.763161
min      4.300000    2.000000    1.000000    0.100000
25%      5.100000    2.800000    1.600000    0.300000
50%      5.800000    3.000000    4.350000    1.300000
75%      6.400000    3.300000    5.100000    1.800000
max      7.900000    4.400000    6.900000    2.500000

In [27]:
new1.describe

<bound method NDFrame.describe of       c1   c2   c3   c4              c5
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    4.7  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]>

In [28]:
new1.describe(include='all')

                c1          c2          c3          c4               c5
count   150.000000  150.000000  150.000000  150.000000              150
unique         NaN         NaN         NaN         NaN                3
top            NaN         NaN         NaN         NaN  Iris-versicolor
freq           NaN         NaN         NaN         NaN               50
mean      5.843333    3.054000    3.758667    1.198667              NaN
std       0.828066    0.433594    1.764420    0.763161              NaN
min       4.300000    2.000000    1.000000    0.100000              NaN
25%       5.100000    2.800000    1.600000    0.300000              NaN
50%       5.800000    3.000000    4.350000    1.300000              NaN
75%       6.400000    3.300000    5.100000    1.800000              NaN
max       7.900000    4.400000    6.900000    2.500000              NaN

In [31]:
cs['5.1'] # prints the only one column, if you provide more columns in it. t gives only those columns details

0      4.9
1      4.7
2      4.6
3      5.0
4      5.4
      ...
144    6.7
145    6.3
146    6.5
147    6.2
148    5.9
Name: 5.1, Length: 149, dtype: float64

In [33]:
cs.isnull() # gives true if it has null value

       5.1    3.5    1.4    0.2  Iris-setosa
0    False  False  False  False        False
1    False  False  False  False        False
2    False  False  False  False        False
3    False  False  False  False        False
4    False  False  False  False        False
..     ...    ...    ...    ...          ...
144  False  False  False  False        False
145  False  False  False  False        False
146  False  False  False  False        False
147  False  False  False  False        False
148  False  False  False  False        False

[149 rows x 5 columns]

In [36]:
new1.isnull().sum() #gives you the number of null values in particular column

c1    0
c2    0
c3    0
c4    0
c5    0
dtype: int64

In [38]:
#iloc method i,e slicing the value
new1.iloc[:3,:] # [rs:re, cs:ce] where r=row and c=column, s=start, e=end, and if none mentioned by default it is all

    c1   c2   c3   c4           c5
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa

In [40]:
new1.iloc[:3,2:]

    c3   c4           c5
0  1.4  0.2  Iris-setosa
1  1.4  0.2  Iris-setosa
2  1.3  0.2  Iris-setosa

In [47]:
new1.head()

    c1   c2   c3   c4           c5
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa
5  5.4  3.9  1.7  0.4  Iris-setosa

In [54]:
#to delete rows
#for deleting row enter row number
new1.drop(3, inplace=False)
new1.head()

    c1   c2   c3   c4           c5
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa
5  5.4  3.9  1.7  0.4  Iris-setosa
6  4.6  3.4  1.4  0.3  Iris-setosa
7  5.0  3.4  1.5  0.2  Iris-setosa

In [58]:
new1.index[0] #it gives the the zeroth index which is zero in this case

3

In [60]:
new1.loc[5] #it gives the details of row 5 as column wise

c1            5.4
c2            3.9
c3            1.7
c4            0.4
c5    Iris-setosa
Name: 5, dtype: object

In [61]:
#to enter the data manually 
new1.loc[0] = [1,2,3,4,'Iris-setosa']
new1.tail()

      c1   c2   c3   c4              c5
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica
0    1.0  2.0  3.0  4.0     Iris-setosa

In [68]:
#to add a new column
new1['ncol'] = new1['c2']-new1['c4']
new1.head()

    c1   c2   c3   c4           c5  ncol
3  4.6  3.1  1.5  0.2  Iris-setosa   2.9
4  5.0  3.6  1.4  0.2  Iris-setosa   3.4
5  5.4  3.9  1.7  0.4  Iris-setosa   3.5
6  4.6  3.4  1.4  0.3  Iris-setosa   3.1
7  5.0  3.4  1.5  0.2  Iris-setosa   3.2

In [67]:
#to drop the columns
cs.drop(1,axis=0, inplace=True) #axis=1 is for column and axis=0 is for rows
cs.head()

   3.5  1.4  0.2  Iris-setosa
0  3.0  1.4  0.2  Iris-setosa
2  3.1  1.5  0.2  Iris-setosa
3  3.6  1.4  0.2  Iris-setosa
4  3.9  1.7  0.4  Iris-setosa
5  3.4  1.4  0.3  Iris-setosa

In [64]:
cs.head()

   3.5  1.4  0.2  Iris-setosa
0  3.0  1.4  0.2  Iris-setosa
1  3.2  1.3  0.2  Iris-setosa
2  3.1  1.5  0.2  Iris-setosa
3  3.6  1.4  0.2  Iris-setosa
4  3.9  1.7  0.4  Iris-setosa